Revit 2027 API
ExternalResourceServerUtils.ServerSupportsCADLinks Method
 Checks that the server referenced by the given ExternalResourceReference supports CAD links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ServerSupportsCADLinks(
	ExternalResourceReference extRef
)
Public Shared Function ServerSupportsCADLinks (
	extRef As ExternalResourceReference
) As Boolean
public:
static bool ServerSupportsCADLinks(
	ExternalResourceReference^ extRef
)
static member ServerSupportsCADLinks :
        extRef : ExternalResourceReference -> bool
Parameters
extRef ExternalResourceReference
 The ExternalResourceReference to check.
Return Value
Boolean
 True if the ExternalResourceReference refers to a server that supports CAD links. False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalResourceServerUtils Class
Autodesk.Revit.DB Namespace